Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS60/edc/PIC32CM1216LS60048.PIC
      <edc:SFRDef edc:_addr="0x4000081C" edc:access="-----------nnnnnnnnnnnnnnnnnnnnn" edc:cname="APBCMASK" edc:impl="0x1FFFFF" edc:mclr="00000000000111111111111111111111" edc:nzwidth="0x20" edc:por="00000000000111111111111111111111" ltx:memberofperipheral="MCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="EVSYS_" edc:desc="EVSYS APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM0_" edc:desc="SERCOM0 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM1_" edc:desc="SERCOM1 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM2_" edc:desc="SERCOM2 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM3_" edc:desc="SERCOM3 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM4_" edc:desc="SERCOM4 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM5_" edc:desc="SERCOM5 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC0_" edc:desc="TC0 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC1_" edc:desc="TC1 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC2_" edc:desc="TC2 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC0_" edc:desc="TCC0 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC1_" edc:desc="TCC1 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC2_" edc:desc="TCC2 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC3_" edc:desc="TCC3 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC_" edc:desc="ADC APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DAC_" edc:desc="DAC APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTC_" edc:desc="PTC APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRNG_" edc:desc="TRNG APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCL_" edc:desc="CCL APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2S_" edc:desc="I2S APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OPAMP_" edc:desc="OPAMP APB Clock Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000820" edc:offset="0x3E0"/>
      <edc:SFRDef edc:_addr="0x40000C00" edc:access="-rrrrrrr" edc:cname="RCAUSE" edc:impl="0x7F" edc:nzwidth="0x8" ltx:memberofperipheral="RSTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSTC">
            <edc:SFRFieldDef edc:cname="POR" edc:desc="Power On Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD12" edc:desc="Brown Out VDDCORE Detector Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD33" edc:desc="Brown Out VDDIO Detector Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD12PLL" edc:desc="Brown Out VDDCORE_PLL Detector Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXT" edc:desc="External Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDT" edc:desc="Watchdog Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYST" edc:desc="System Reset Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000C01" edc:offset="0x3FF"/>
      <edc:SFRDef edc:_addr="0x40001000" edc:access="-----nnn" edc:cname="EVCTRL" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="CFDEO" edc:desc="Clock Failure Detector Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TUNEEI" edc:desc="Tune Event Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TUNEINV" edc:desc="Tune Event Input Invert" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40001001" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x40001004" edc:access="---nnnnn----nnnn-----nnn---n--nn" edc:cname="INTENCLR" edc:impl="0x1F0F0713" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="XOSCRDY" edc:desc="XOSC Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XOSCFAIL" edc:desc="XOSC Clock Failure Detector Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OSC16MRDY" edc:desc="OSC16M Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DFLLULPRDY" edc:desc="DFLLULP Ready interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLULPLOCK" edc:desc="DFLLULP Lock Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLULPNOLOCK" edc:desc="DFLLULP No Lock Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKR" edc:desc="DPLL Lock Rise Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKF" edc:desc="DPLL Lock Fall Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLLTO" edc:desc="DPLL Lock Timeout Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLLDRTO" edc:desc="DPLL Loop Divider Ratio Update Complete Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DFLLRDY" edc:desc="DFLL Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLOOB" edc:desc="DFLL Out Of Bounds Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKF" edc:desc="DFLL Lock Fine Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKC" edc:desc="DFLL Lock Coarse Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLRCS" edc:desc="DFLL Reference Clock Stopped Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
