Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS60/edc/PIC32CM1216LS60048.PIC
      <edc:SFRDef edc:_addr="0x40002005" edc:access="-------n" edc:cname="INTENSET" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="WDT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="WDT">
            <edc:SFRFieldDef edc:cname="EW" edc:desc="Early Warning Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002006" edc:access="-------n" edc:cname="INTFLAG" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="WDT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="WDT">
            <edc:SFRFieldDef edc:cname="EW" edc:desc="Early Warning" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40002007" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x40002008" edc:access="--------------------------rrrrr-" edc:cname="SYNCBUSY" edc:impl="0x3E" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="WDT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="WDT">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WEN" edc:desc="Window Enable Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run During Standby Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ALWAYSON" edc:desc="Always-On Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLEAR" edc:desc="Clear Synchronization Busy" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000200C" edc:access="wwwwwwww" edc:cname="CLEAR" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="WDT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="WDT">
            <edc:SFRFieldDef edc:cname="CLEAR" edc:desc="Watchdog Clear" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="KEY" edc:desc="Clear Key" edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4000200D" edc:offset="0x401"/>
      <edc:SFRDef edc:_addr="0x4000240E" edc:access="-------n" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Run During Debug" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4000240F" edc:offset="0x5"/>
      <edc:SFRDef edc:_addr="0x40002414" edc:access="nnnnnnnn" edc:cname="FREQCORR" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="VALUE" edc:desc="Correction Value" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="SIGN" edc:desc="Correction Sign" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40002415" edc:offset="0x2B"/>
      <edc:SFRDef edc:_addr="0x40002440" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GP0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="GP" edc:desc="General Purpose" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002444" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GP1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="GP" edc:desc="General Purpose" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40002448" edc:offset="0x18"/>
      <edc:SFRDef edc:_addr="0x40002460" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TAMPCTRL" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="IN0ACT" edc:desc="Tamper Input 0 Action" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off (Disabled)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="WAKE" edc:desc="Wake and set Tamper flag" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CAPTURE" edc:desc="Capture timestamp and set Tamper flag" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="ACTL" edc:desc="Compare IN0 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="IN1ACT" edc:desc="Tamper Input 1 Action" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off (Disabled)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="WAKE" edc:desc="Wake and set Tamper flag" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CAPTURE" edc:desc="Capture timestamp and set Tamper flag" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="ACTL" edc:desc="Compare IN1 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="IN2ACT" edc:desc="Tamper Input 2 Action" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off (Disabled)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="WAKE" edc:desc="Wake and set Tamper flag" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CAPTURE" edc:desc="Capture timestamp and set Tamper flag" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="ACTL" edc:desc="Compare IN2 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="IN3ACT" edc:desc="Tamper Input 3 Action" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off (Disabled)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="WAKE" edc:desc="Wake and set Tamper flag" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CAPTURE" edc:desc="Capture timestamp and set Tamper flag" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="ACTL" edc:desc="Compare IN3 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="IN4ACT" edc:desc="Tamper Input 4 Action" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off (Disabled)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="WAKE" edc:desc="Wake and set Tamper flag" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CAPTURE" edc:desc="Capture timestamp and set Tamper flag" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="ACTL" edc:desc="Compare IN4 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="IN5ACT" edc:desc="Tamper Input 5 Action" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off (Disabled)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="WAKE" edc:desc="Wake and set Tamper flag" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CAPTURE" edc:desc="Capture timestamp and set Tamper flag" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="ACTL" edc:desc="Compare IN5 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="IN6ACT" edc:desc="Tamper Input 6 Action" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off (Disabled)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="WAKE" edc:desc="Wake and set Tamper flag" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CAPTURE" edc:desc="Capture timestamp and set Tamper flag" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="ACTL" edc:desc="Compare IN6 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="IN7ACT" edc:desc="Tamper Input 7 Action" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off (Disabled)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="WAKE" edc:desc="Wake and set Tamper flag" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CAPTURE" edc:desc="Capture timestamp and set Tamper flag" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="ACTL" edc:desc="Compare IN7 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TAMLVL0" edc:desc="Tamper Level Select 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TAMLVL1" edc:desc="Tamper Level Select 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TAMLVL2" edc:desc="Tamper Level Select 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TAMLVL3" edc:desc="Tamper Level Select 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TAMLVL4" edc:desc="Tamper Level Select 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TAMLVL5" edc:desc="Tamper Level Select 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TAMLVL6" edc:desc="Tamper Level Select 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TAMLVL7" edc:desc="Tamper Level Select 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DEBNC0" edc:desc="Debouncer Enable 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DEBNC1" edc:desc="Debouncer Enable 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DEBNC2" edc:desc="Debouncer Enable 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DEBNC3" edc:desc="Debouncer Enable 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DEBNC4" edc:desc="Debouncer Enable 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DEBNC5" edc:desc="Debouncer Enable 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DEBNC6" edc:desc="Debouncer Enable 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DEBNC7" edc:desc="Debouncer Enable 7" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40002464" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x40002468" edc:access="n-----------------------nnnnnnnn" edc:cname="TAMPID" edc:impl="0x800000FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="TAMPID0" edc:desc="Tamper Input 0 Detected" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TAMPID1" edc:desc="Tamper Input 1 Detected" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TAMPID2" edc:desc="Tamper Input 2 Detected" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TAMPID3" edc:desc="Tamper Input 3 Detected" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TAMPID4" edc:desc="Tamper Input 4 Detected" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TAMPID5" edc:desc="Tamper Input 5 Detected" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TAMPID6" edc:desc="Tamper Input 6 Detected" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TAMPID7" edc:desc="Tamper Input 7 Detected" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x17"/>
            <edc:SFRFieldDef edc:cname="TAMPEVT" edc:desc="Tamper Event Detected" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000246C" edc:access="------------------------nnnnnnnn" edc:cname="TAMPCTRLB" edc:impl="0xFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="ALSI0" edc:desc="Active Layer Select Internal 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ALSI1" edc:desc="Active Layer Select Internal 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ALSI2" edc:desc="Active Layer Select Internal 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ALSI3" edc:desc="Active Layer Select Internal 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ALSI4" edc:desc="Active Layer Select Internal 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ALSI5" edc:desc="Active Layer Select Internal 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ALSI6" edc:desc="Active Layer Select Internal 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ALSI7" edc:desc="Active Layer Select Internal 7" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40002470" edc:offset="0x390"/>
      <edc:SFRDef edc:_addr="0x40002800" edc:access="---n--nn" edc:cname="CTRLA" edc:impl="0x13" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CKSEL" edc:desc="Clock Selection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="CLK_GCLK" edc:desc="Clocked by GCLK" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CLK_ULP32K" edc:desc="Clocked by ULP32K" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
