Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS60/edc/PIC32CM1216LS60048.PIC
      <edc:AdjustPoint edc:_addr="0x40002A24" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x40002A30" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="DEBOUNCEN" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="DEBOUNCEN0" edc:desc="Debouncer Enable of EXTINT0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN1" edc:desc="Debouncer Enable of EXTINT1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN2" edc:desc="Debouncer Enable of EXTINT2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN3" edc:desc="Debouncer Enable of EXTINT3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN4" edc:desc="Debouncer Enable of EXTINT4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN5" edc:desc="Debouncer Enable of EXTINT5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN6" edc:desc="Debouncer Enable of EXTINT6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN7" edc:desc="Debouncer Enable of EXTINT7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN8" edc:desc="Debouncer Enable of EXTINT8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN9" edc:desc="Debouncer Enable of EXTINT9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN10" edc:desc="Debouncer Enable of EXTINT10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN11" edc:desc="Debouncer Enable of EXTINT11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN12" edc:desc="Debouncer Enable of EXTINT12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN13" edc:desc="Debouncer Enable of EXTINT13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN14" edc:desc="Debouncer Enable of EXTINT14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN15" edc:desc="Debouncer Enable of EXTINT15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002A34" edc:access="---------------n--------nnnnnnnn" edc:cname="DPRESCALER" edc:impl="0x100FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="PRESCALER0" edc:desc="Debouncer Prescaler" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="EIC clock divided by 2" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="EIC clock divided by 4" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="EIC clock divided by 8" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="EIC clock divided by 16" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="EIC clock divided by 32" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="EIC clock divided by 64" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="EIC clock divided by 128" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="EIC clock divided by 256" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STATES0" edc:desc="Debouncer number of states" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LFREQ3" edc:desc="3 low frequency samples" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LFREQ7" edc:desc="7 low frequency samples" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PRESCALER1" edc:desc="Debouncer Prescaler" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="EIC clock divided by 2" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="EIC clock divided by 4" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="EIC clock divided by 8" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="EIC clock divided by 16" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="EIC clock divided by 32" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="EIC clock divided by 64" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="EIC clock divided by 128" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="EIC clock divided by 256" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STATES1" edc:desc="Debouncer number of states" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LFREQ3" edc:desc="3 low frequency samples" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LFREQ7" edc:desc="7 low frequency samples" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="TICKON" edc:desc="Pin Sampler frequency selection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="CLK_GCLK_EIC" edc:desc="Clocked by GCLK" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CLK_LFREQ" edc:desc="Clocked by Low Frequency Clock" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
