Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS60/edc/PIC32CM1216LS60048.PIC
      <edc:AdjustPoint edc:_addr="0x41006022" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x41006024" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="INTSTATUS" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="CHINT0" edc:desc="Channel 0 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT1" edc:desc="Channel 1 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT2" edc:desc="Channel 2 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT3" edc:desc="Channel 3 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT4" edc:desc="Channel 4 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT5" edc:desc="Channel 5 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT6" edc:desc="Channel 6 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT7" edc:desc="Channel 7 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT8" edc:desc="Channel 8 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT9" edc:desc="Channel 9 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT10" edc:desc="Channel 10 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT11" edc:desc="Channel 11 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT12" edc:desc="Channel 12 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT13" edc:desc="Channel 13 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT14" edc:desc="Channel 14 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT15" edc:desc="Channel 15 Pending Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41006028" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="BUSYCH" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="BUSYCH0" edc:desc="Busy Channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH1" edc:desc="Busy Channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH2" edc:desc="Busy Channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH3" edc:desc="Busy Channel 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH4" edc:desc="Busy Channel 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH5" edc:desc="Busy Channel 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH6" edc:desc="Busy Channel 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH7" edc:desc="Busy Channel 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH8" edc:desc="Busy Channel 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH9" edc:desc="Busy Channel 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH10" edc:desc="Busy Channel 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH11" edc:desc="Busy Channel 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH12" edc:desc="Busy Channel 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH13" edc:desc="Busy Channel 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH14" edc:desc="Busy Channel 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH15" edc:desc="Busy Channel 15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100602C" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="PENDCH" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="PENDCH0" edc:desc="Pending Channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH1" edc:desc="Pending Channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH2" edc:desc="Pending Channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH3" edc:desc="Pending Channel 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH4" edc:desc="Pending Channel 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH5" edc:desc="Pending Channel 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH6" edc:desc="Pending Channel 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH7" edc:desc="Pending Channel 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH8" edc:desc="Pending Channel 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH9" edc:desc="Pending Channel 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH10" edc:desc="Pending Channel 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH11" edc:desc="Pending Channel 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH12" edc:desc="Pending Channel 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH13" edc:desc="Pending Channel 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH14" edc:desc="Pending Channel 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH15" edc:desc="Pending Channel 15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41006030" edc:access="rrrrrrrrrrrrrrrrr--rrrrr----rrrr" edc:cname="ACTIVE" edc:impl="0xFFFF9F0F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="LVLEX0" edc:desc="Level 0 Channel Trigger Request Executing" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLEX1" edc:desc="Level 1 Channel Trigger Request Executing" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLEX2" edc:desc="Level 2 Channel Trigger Request Executing" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLEX3" edc:desc="Level 3 Channel Trigger Request Executing" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ID" edc:desc="Active Channel ID" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ABUSY" edc:desc="Active Channel Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BTCNT" edc:desc="Active Channel Block Transfer Count" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41006034" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BASEADDR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="BASEADDR" edc:desc="Descriptor Memory Base Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41006038" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="WRBADDR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="WRBADDR" edc:desc="Write-Back Memory Base Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100603C" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x4100603F" edc:access="----nnnn" edc:cname="CHID" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="ID" edc:desc="Channel ID" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41006040" edc:access="-n----nn" edc:cname="CHCTRLA" edc:impl="0x43" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Channel Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Channel Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Channel run in standby" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41006041" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x41006044" edc:access="------nnnn--------nnnnnn-nnnnnnn" edc:cname="CHCTRLB" edc:impl="0x3C03F7F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="EVACT" edc:desc="Event Input Action" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NOACT" edc:desc="No action" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TRIG" edc:desc="Transfer and periodic transfer trigger" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CTRIG" edc:desc="Conditional transfer trigger" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CBLOCK" edc:desc="Conditional block transfer" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="SUSPEND" edc:desc="Channel suspend operation" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="RESUME" edc:desc="Channel resume operation" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="SSKIP" edc:desc="Skip next block suspend action" edc:when="(field &amp; 0x7) == 0x6"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EVIE" edc:desc="Channel Event Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVOE" edc:desc="Channel Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL" edc:desc="Channel Arbitration Level" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="LVL0" edc:desc="Channel Priority Level 0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LVL1" edc:desc="Channel Priority Level 1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="LVL2" edc:desc="Channel Priority Level 2" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="LVL3" edc:desc="Channel Priority Level 3" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIGSRC" edc:desc="Trigger Source" edc:nzwidth="0x6">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Only software/event triggers" edc:when="(field &amp; 0x3F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RTC_TIMESTAMP" edc:desc="RTC Timestamp Trigger" edc:when="(field &amp; 0x3F) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DSU_DCC0" edc:desc="ID for DCC0 register" edc:when="(field &amp; 0x3F) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DSU_DCC1" edc:desc="ID for DCC1 register" edc:when="(field &amp; 0x3F) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM0_RX" edc:desc="SERCOM0 RX Trigger" edc:when="(field &amp; 0x3F) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM0_TX" edc:desc="SERCOM0 TX Trigger" edc:when="(field &amp; 0x3F) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM1_RX" edc:desc="SERCOM1 RX Trigger" edc:when="(field &amp; 0x3F) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM1_TX" edc:desc="SERCOM1 TX Trigger" edc:when="(field &amp; 0x3F) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM2_RX" edc:desc="SERCOM2 RX Trigger" edc:when="(field &amp; 0x3F) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM2_TX" edc:desc="SERCOM2 TX Trigger" edc:when="(field &amp; 0x3F) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM3_RX" edc:desc="SERCOM3 RX Trigger" edc:when="(field &amp; 0x3F) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM3_TX" edc:desc="SERCOM3 TX Trigger" edc:when="(field &amp; 0x3F) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM4_RX" edc:desc="SERCOM4 RX Trigger" edc:when="(field &amp; 0x3F) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM4_TX" edc:desc="SERCOM4 TX Trigger" edc:when="(field &amp; 0x3F) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM5_RX" edc:desc="SERCOM5 RX Trigger" edc:when="(field &amp; 0x3F) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM5_TX" edc:desc="SERCOM5 TX Trigger" edc:when="(field &amp; 0x3F) == 0x0F"/>
              <edc:SFRFieldSemantic edc:cname="TC0_OVF" edc:desc="TC0 Overflow Trigger" edc:when="(field &amp; 0x3F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="TC0_MC0" edc:desc="TC0 Match/Compare 0 Trigger" edc:when="(field &amp; 0x3F) == 0x11"/>
              <edc:SFRFieldSemantic edc:cname="TC0_MC1" edc:desc="TC0 Match/Compare 1 Trigger" edc:when="(field &amp; 0x3F) == 0x12"/>
              <edc:SFRFieldSemantic edc:cname="TC1_OVF" edc:desc="TC1 Overflow Trigger" edc:when="(field &amp; 0x3F) == 0x13"/>
              <edc:SFRFieldSemantic edc:cname="TC1_MC0" edc:desc="TC1 Match/Compare 0 Trigger" edc:when="(field &amp; 0x3F) == 0x14"/>
              <edc:SFRFieldSemantic edc:cname="TC1_MC1" edc:desc="TC1 Match/Compare 1 Trigger" edc:when="(field &amp; 0x3F) == 0x15"/>
              <edc:SFRFieldSemantic edc:cname="TC2_OVF" edc:desc="TC2 Overflow Trigger" edc:when="(field &amp; 0x3F) == 0x16"/>
              <edc:SFRFieldSemantic edc:cname="TC2_MC0" edc:desc="TC2 Match/Compare 0 Trigger" edc:when="(field &amp; 0x3F) == 0x17"/>
              <edc:SFRFieldSemantic edc:cname="TC2_MC1" edc:desc="TC2 Match/Compare 1 Trigger" edc:when="(field &amp; 0x3F) == 0x18"/>
              <edc:SFRFieldSemantic edc:cname="TCC0_OVF" edc:desc="TCC0 Overflow Trigger" edc:when="(field &amp; 0x3F) == 0x19"/>
              <edc:SFRFieldSemantic edc:cname="TCC0_MC0" edc:desc="TCC0 Match/Compare 0 Trigger" edc:when="(field &amp; 0x3F) == 0x1A"/>
              <edc:SFRFieldSemantic edc:cname="TCC0_MC1" edc:desc="TCC0 Match/Compare 1 Trigger" edc:when="(field &amp; 0x3F) == 0x1B"/>
              <edc:SFRFieldSemantic edc:cname="TCC0_MC2" edc:desc="TCC0 Match/Compare 2 Trigger" edc:when="(field &amp; 0x3F) == 0x1C"/>
              <edc:SFRFieldSemantic edc:cname="TCC0_MC3" edc:desc="TCC0 Match/Compare 3 Trigger" edc:when="(field &amp; 0x3F) == 0x1D"/>
              <edc:SFRFieldSemantic edc:cname="TCC1_OVF" edc:desc="TCC1 Overflow Trigger" edc:when="(field &amp; 0x3F) == 0x1E"/>
              <edc:SFRFieldSemantic edc:cname="TCC1_MC0" edc:desc="TCC1 Match/Compare 0 Trigger" edc:when="(field &amp; 0x3F) == 0x1F"/>
              <edc:SFRFieldSemantic edc:cname="TCC1_MC1" edc:desc="TCC1 Match/Compare 1 Trigger" edc:when="(field &amp; 0x3F) == 0x20"/>
              <edc:SFRFieldSemantic edc:cname="TCC2_OVF" edc:desc="TCC2 Overflow Trigger" edc:when="(field &amp; 0x3F) == 0x21"/>
              <edc:SFRFieldSemantic edc:cname="TCC2_MC0" edc:desc="TCC2 Match/Compare 0 Trigger" edc:when="(field &amp; 0x3F) == 0x22"/>
              <edc:SFRFieldSemantic edc:cname="TCC2_MC1" edc:desc="TCC2 Match/Compare 1 Trigger" edc:when="(field &amp; 0x3F) == 0x23"/>
              <edc:SFRFieldSemantic edc:cname="TCC3_OVF" edc:desc="TCC3 Overflow Trigger" edc:when="(field &amp; 0x3F) == 0x24"/>
              <edc:SFRFieldSemantic edc:cname="TCC3_MC0" edc:desc="TCC3 Match/Compare 0 Trigger" edc:when="(field &amp; 0x3F) == 0x25"/>
              <edc:SFRFieldSemantic edc:cname="TCC3_MC1" edc:desc="TCC3 Match/Compare 1 Trigger" edc:when="(field &amp; 0x3F) == 0x26"/>
              <edc:SFRFieldSemantic edc:cname="TCC3_MC2" edc:desc="TCC3 Match/Compare 2 Trigger" edc:when="(field &amp; 0x3F) == 0x27"/>
              <edc:SFRFieldSemantic edc:cname="TCC3_MC3" edc:desc="TCC3 Match/Compare 3 Trigger" edc:when="(field &amp; 0x3F) == 0x28"/>
              <edc:SFRFieldSemantic edc:cname="ADC_RESRDY" edc:desc="ADC Result Ready Trigger" edc:when="(field &amp; 0x3F) == 0x29"/>
              <edc:SFRFieldSemantic edc:cname="DAC_EMPTY0" edc:desc="DAC Empty 0 Trigger" edc:when="(field &amp; 0x3F) == 0x2A"/>
              <edc:SFRFieldSemantic edc:cname="DAC_EMPTY1" edc:desc="DAC Empty 1 Trigger" edc:when="(field &amp; 0x3F) == 0x2B"/>
              <edc:SFRFieldSemantic edc:cname="PTC_EOC" edc:desc="PTC End of Conversion Trigger" edc:when="(field &amp; 0x3F) == 0x2C"/>
              <edc:SFRFieldSemantic edc:cname="PTC_SEQ" edc:desc="PTC Sequence Trigger" edc:when="(field &amp; 0x3F) == 0x2D"/>
              <edc:SFRFieldSemantic edc:cname="PTC_WCOMP" edc:desc="PTC Window Compare Trigger" edc:when="(field &amp; 0x3F) == 0x2E"/>
              <edc:SFRFieldSemantic edc:cname="I2S_RX0" edc:desc="I2S RX0 Trigger" edc:when="(field &amp; 0x3F) == 0x2F"/>
              <edc:SFRFieldSemantic edc:cname="I2S_RX1" edc:desc="I2S RX1 Trigger" edc:when="(field &amp; 0x3F) == 0x30"/>
              <edc:SFRFieldSemantic edc:cname="I2S_TX0" edc:desc="I2S TX0 Trigger" edc:when="(field &amp; 0x3F) == 0x31"/>
              <edc:SFRFieldSemantic edc:cname="I2S_TX1" edc:desc="I2S TX1 Trigger" edc:when="(field &amp; 0x3F) == 0x32"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="TRIGACT" edc:desc="Trigger Action" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="BLOCK" edc:desc="One trigger required for each block transfer" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BEAT" edc:desc="One trigger required for each beat transfer" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TRANSACTION" edc:desc="One trigger required for each transaction" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMD" edc:desc="Software Command" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NOACT" edc:desc="No action" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SUSPEND" edc:desc="Channel suspend operation" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="RESUME" edc:desc="Channel resume operation" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41006048" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x4100604C" edc:access="-----nnn" edc:cname="CHINTENCLR" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="TERR" edc:desc="Channel Transfer Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCMPL" edc:desc="Channel Transfer Complete Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:desc="Channel Suspend Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100604D" edc:access="-----nnn" edc:cname="CHINTENSET" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="TERR" edc:desc="Channel Transfer Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCMPL" edc:desc="Channel Transfer Complete Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:desc="Channel Suspend Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100604E" edc:access="-----nnn" edc:cname="CHINTFLAG" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="TERR" edc:desc="Channel Transfer Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCMPL" edc:desc="Channel Transfer Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:desc="Channel Suspend" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100604F" edc:access="-----rrr" edc:cname="CHSTATUS" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="PEND" edc:desc="Channel Pending" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSY" edc:desc="Channel Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FERR" edc:desc="Channel Fetch Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41006050" edc:offset="0x3FB0"/>
      <edc:SFRDef edc:_addr="0x4100A000" edc:access="n----nnn" edc:cname="CTRLA" edc:impl="0x87" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby Mode" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="Operating Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DEVICE" edc:desc="Device Mode" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HOST" edc:desc="Host Mode" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
