Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS60/edc/PIC32CM1216LS60048.PIC
      <edc:AdjustPoint edc:_addr="0xE000EDA4" edc:offset="0x1C"/>
      <edc:SFRDef edc:_addr="0xE000EDC0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MPU_MAIR0" edc:nzwidth="0x20" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="Attr0" edc:desc="Attribute of MPU region 0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="Attr1" edc:desc="Attribute of MPU region 1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="Attr2" edc:desc="Attribute of MPU region 2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="Attr3" edc:desc="Attribute of MPU region 3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EDC4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MPU_MAIR1" edc:nzwidth="0x20" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="Attr4" edc:desc="Attribute of MPU region 4" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="Attr5" edc:desc="Attribute of MPU region 5" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="Attr6" edc:desc="Attribute of MPU region 6" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="Attr7" edc:desc="Attribute of MPU region 7" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000EDC8" edc:offset="0x28"/>
      <edc:SFRDef edc:_addr="0xE000EDF0" edc:access="-----nnn---nnnnn----------n-nnnn" edc:cname="DHCSR" edc:impl="0x71F002F" edc:nzwidth="0x20" ltx:memberofperipheral="CoreDebug">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug">
            <edc:SFRFieldDef edc:cname="C_DEBUGEN" edc:desc="Enable Halting debug" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_HALT" edc:desc="Halt processor" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_STEP" edc:desc="Enable single step" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_MASKINTS" edc:desc="Mask PendSV, SysTick and external configurable interrupts" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="S_SNAPSTALL" edc:desc="Snap stall control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="S_REGRDY" edc:desc="Register ready status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S_HALT" edc:desc="Halted status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S_SLEEP" edc:desc="Sleeping status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S_LOCKUP" edc:desc="Lockup status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S_SDE" edc:desc="Secure debug enabled" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="S_RETIRE_ST" edc:desc="Retire sticky status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S_RESET_ST" edc:desc="Reset sticky status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S_RESTART_ST" edc:desc="Restart sticky status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EDF4" edc:access="---------------w---------wwwwwww" edc:cname="DCRSR" edc:impl="0x1007F" edc:nzwidth="0x20" ltx:memberofperipheral="CoreDebug">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug">
            <edc:SFRFieldDef edc:cname="REGSEL" edc:desc="Register selector" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="REGWnR" edc:desc="Register write/not-read access" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000EDF8" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0xE000EDFC" edc:access="-------n---nnnnn----nnnnnnnn---n" edc:cname="DEMCR" edc:impl="0x11F0FF1" edc:nzwidth="0x20" ltx:memberofperipheral="CoreDebug">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug">
            <edc:SFRFieldDef edc:cname="VC_CORERESET" edc:desc="Core reset Halting debug vector catch enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VC_MMERR" edc:desc="MemManage exception Halting debug vector catch enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_NOCPERR" edc:desc="UsageFault exception coprocessor access Halting debug vector catch enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_CHKERR" edc:desc="UsageFault exception checking error Halting debug vector catch enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_STATERR" edc:desc="UsageFault exception state information error Halting debug vector catch enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_BUSERR" edc:desc="BusFault exception Halting debug vector catch enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_INTERR" edc:desc="Excception entry and return faults Halting debug vector catch enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_HARDERR" edc:desc="HardFault exception Halting debug vector catch enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_SFERR" edc:desc="SecureFault exception Halting debug vector catch enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MON_EN" edc:desc="DebugMonitor enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MON_PEND" edc:desc="DebugMonitor pending state" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MON_STEP" edc:desc="Enable DebugMonitor stepping" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MON_REQ" edc:desc="DebugMonitor semaphore bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SDME" edc:desc="Secure DebugMonitor enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TRCENA" edc:desc="Global DWT and ITM features enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
